# Data Wargling (Join)
# => # => (inner, outer, left, right)
# => df.join()
# => df.merge()
# => pd.concat()

# Group by
# => df.groupby(by)
# => unstact
# => pivot_Table

# Handling Missing Values

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({"CNIC": np.random.randint(1,20, size=20),
                   "Account No":np.random.randint(1,5, size=(20))})

df1
#12345-1234567-3
#1234512345673

    CNIC  Account No
0     12           4
1     15           2
2      1           4
3      2           2
4      4           2
5     19           1
6     11           2
7      7           4
8      8           4
9      4           3
10    19           4
11     9           4
12    10           2
13     7           2
14    15           4
15     4           1
16    18           4
17    11           2
18    14           1
19    11           2

In [3]:
df2 = pd.DataFrame({"CNIC": np.random.randint(1,20, size=(20)),
                   "Account No":np.random.randint(1,5, size=(20)),
                   "Mobile No":np.random.randint(2001,3000, size=(20)),
                  "DOB":pd.date_range('1990-01-01', periods=20, freq="M"),
                  "CustomerName":[chr(x) for x in np.random.randint(65,91, size=(20))],
                   "Gender":np.random.choice(["M","F"], size=(20))})
df2

    CNIC  Account No  Mobile No        DOB CustomerName Gender
0     12           4       2010 1990-01-31            O      F
1      5           2       2197 1990-02-28            A      F
2     13           3       2185 1990-03-31            Q      F
3      2           1       2284 1990-04-30            Q      F
4      7           3       2255 1990-05-31            R      M
5     17           2       2349 1990-06-30            B      M
6      8           1       2537 1990-07-31            C      M
7      9           1       2219 1990-08-31            Y      F
8     18           2       2136 1990-09-30            K      F
9     12           1       2747 1990-10-31            H      M
10     7           4       2673 1990-11-30            M      M
11     6           3       2509 1990-12-31            M      F
12     3           2       2213 1991-01-31            K      F
13    10           1       2024 1991-02-28            F      M
14     5           2       2487 1991-03-31            Q      M
15     4           2       2968 1991-04-30            O      F
16     2           1       2854 1991-05-31            Q      F
17     1           1       2189 1991-06-30            N      F
18    16           4       2949 1991-07-31            I      M
19    12           1       2955 1991-08-31            Q      M

In [4]:
print(df1.dtypes, df2.dtypes, sep="\n\n\n")

CNIC          int64
Account No    int64
dtype: object


CNIC                     int64
Account No               int64
Mobile No                int64
DOB             datetime64[ns]
CustomerName            object
Gender                  object
dtype: object

columnNameSameInBothDataframes
Name(optional), datatype, data_pattern

#data_frame_left.merge(dataframe_right, on="columnNameSameInBothDataframes", how="typeofJoin")
#typeofJoin=inner,outer,left,right

#data_frame_left.merge(dataframe_right, on=[col1,col2,col3], how="typeofJoin")

#data_frame_left.merge(dataframe_right, on=[col1,col2,col3], how="typeofJoin")

#if columns name differents in both table 

#data_frame_left.merge(dataframe_right, left_on="col", right_on="col", how="typeofJoin")

#data_frame_left.merge(dataframe_right, left_index=True, right_index=True, how='outer')

#### data_frame_left.merge(dataframe_right, on="columnNameSameInBothDataframes", how="typeofJoin")

In [5]:
a = df1.merge(df2, on="CNIC", how='inner')
a

    CNIC  Account No_x  Account No_y  Mobile No        DOB CustomerName Gender
0     12             4             4       2010 1990-01-31            O      F
1     12             4             1       2747 1990-10-31            H      M
2     12             4             1       2955 1991-08-31            Q      M
3      1             4             1       2189 1991-06-30            N      F
4      2             2             1       2284 1990-04-30            Q      F
5      2             2             1       2854 1991-05-31            Q      F
6      4             2             2       2968 1991-04-30            O      F
7      4             3             2       2968 1991-04-30            O      F
8      4             1             2       2968 1991-04-30            O      F
9      7             4             3       2255 1990-05-31            R      M
10     7             4             4       2673 1990-11-30            M      M
11     7             2             3       2255 1990-05-31            R      M
12     7             2             4       2673 1990-11-30            M      M
13     8             4             1       2537 1990-07-31            C      M
14     9             4             1       2219 1990-08-31            Y      F
15    10             2             1       2024 1991-02-28            F      M
16    18             4             2       2136 1990-09-30            K      F

### data_frame_left.merge(dataframe_right, on=[col1,col2,col3], how="typeofJoin")

In [7]:
a = df1.merge(df2, on=["CNIC","Account No"], how="inner") #Join with multiples columns
a

   CNIC  Account No  Mobile No        DOB CustomerName Gender
0    12           4       2010 1990-01-31            O      F
1     4           2       2968 1991-04-30            O      F
2     7           4       2673 1990-11-30            M      M

##### data_frame_left.merge(dataframe_right, left_on="col", right_on="col", how="typeofJoin")

In [8]:
df1.columns

Index(['CNIC', 'Account No'], dtype='object')

In [9]:
df1.columns = ['Customer CNIC', 'Customer Account No']
df1.head(2)

   Customer CNIC  Customer Account No
0             12                    4
1             15                    2

In [10]:
df2.head(2)

   CNIC  Account No  Mobile No        DOB CustomerName Gender
0    12           4       2010 1990-01-31            O      F
1     5           2       2197 1990-02-28            A      F

In [11]:
a = df1.merge(df2, left_on="Customer CNIC", right_on="CNIC")
a

,Customer CNIC,Customer Account No,CNIC,Account No,Mobile No,DOB,CustomerName,Gender
0,12,4,12,4,2010,1990-01-31,O,F
1,12,4,12,1,2747,1990-10-31,H,M
2,12,4,12,1,2955,1991-08-31,Q,M
3,1,4,1,1,2189,1991-06-30,N,F
4,2,2,2,1,2284,1990-04-30,Q,F
5,2,2,2,1,2854,1991-05-31,Q,F
6,4,2,4,2,2968,1991-04-30,O,F
7,4,3,4,2,2968,1991-04-30,O,F
8,4,1,4,2,2968,1991-04-30,O,F
9,7,4,7,3,2255,1990-05-31,R,M
10,7,4,7,4,2673,1990-11-30,M,M
11,7,2,7,3,2255,1990-05-31,R,M
12,7,2,7,4,2673,1990-11-30,M,M
13,8,4,8,1,2537,1990-07-31,C,M
14,9,4,9,1,2219,1990-08-31,Y,F
15,10,2,10,1,2024,1991-02-28,F,M
16,18,4,18,2,2136,1990-09-30,K,F

In [12]:
a = df1.merge(df2, left_on=["Customer CNIC","Customer Account No"], right_on=["CNIC","Account No"])
a

,Customer CNIC,Customer Account No,CNIC,Account No,Mobile No,DOB,CustomerName,Gender
0,12,4,12,4,2010,1990-01-31,O,F
1,4,2,4,2,2968,1991-04-30,O,F
2,7,4,7,4,2673,1990-11-30,M,M

##### data_frame_left.merge(dataframe_right, left_index=True, right_index=True, how='outer')

In [50]:
customers = pd.DataFrame({"Customers NIC": [14,6,19,22],"Customer Name":["A","B","C","D"]})


transactions = pd.DataFrame({"CNIC": np.random.choice([14,6,19,21], size=(20)),
                   "TransactionID":np.random.randint(1,2, size=(20)),
                  "Transaction Date":pd.date_range('1990-01-01', periods=20, freq="M"),
                   "Description":np.random.choice(["TopUP","IBFT","FT"], size=(20)),
                            "Amount":np.random.randint(1,1000000, size=(20))})


customers

   Customers NIC Customer Name
0             14             A
1              6             B
2             19             C
3             22             D

In [51]:
transactions

    CNIC  TransactionID Transaction Date Description  Amount
0     14              1       1990-01-31       TopUP  707642
1      6              1       1990-02-28          FT  693605
2     21              1       1990-03-31       TopUP  853080
3     14              1       1990-04-30       TopUP  726593
4     21              1       1990-05-31          FT  404788
5     14              1       1990-06-30       TopUP  555707
6     21              1       1990-07-31       TopUP    1566
7     21              1       1990-08-31       TopUP  278120
8     14              1       1990-09-30        IBFT  208791
9     21              1       1990-10-31       TopUP  591296
10     6              1       1990-11-30          FT  402643
11    14              1       1990-12-31        IBFT  274889
12     6              1       1991-01-31        IBFT   10984
13    21              1       1991-02-28        IBFT  768238
14    21              1       1991-03-31          FT  587934
15    14              1       1991-04-30          FT  552281
16    14              1       1991-05-31          FT  168377
17    14              1       1991-06-30       TopUP  651997
18     6              1       1991-07-31       TopUP  989589
19     6              1       1991-08-31          FT  406363

In [52]:
c = transactions.CNIC.value_counts()
print(c.index)
print(c.values)
print()
print(c)

Int64Index([14, 21, 6], dtype='int64')
[8 7 5]

14    8
21    7
6     5
Name: CNIC, dtype: int64

In [53]:
a = customers.merge(c, left_on="Customers NIC", right_index=True, how='left')
a.columns = ['Customers NIC', 'Customer Name', 'Transaction counts']
a

   Customers NIC Customer Name  Transaction counts
0             14             A                 8.0
1              6             B                 5.0
2             19             C                 NaN
3             22             D                 NaN

In [54]:
a = customers.merge(c, left_on="Customers NIC", right_index=True, how='right')
a.columns = ['Customers NIC', 'Customer Name', 'Transaction counts']
a

     Customers NIC Customer Name  Transaction counts
0.0             14             A                   8
1.0              6             B                   5
NaN             21           NaN                   7

In [55]:
a = customers.merge(c, left_on="Customers NIC", right_index=True, how='inner')
a.columns = ['Customers NIC', 'Customer Name', 'Transaction counts']
a

   Customers NIC Customer Name  Transaction counts
0             14             A                   8
1              6             B                   5

In [56]:
a = customers.merge(c, left_on="Customers NIC", right_index=True, how='outer')
a.columns = ['Customers NIC', 'Customer Name', 'Transaction counts']
a

     Customers NIC Customer Name  Transaction counts
0.0             14             A                 8.0
1.0              6             B                 5.0
2.0             19             C                 NaN
3.0             22             D                 NaN
NaN             21           NaN                 7.0

# Slabs
* pd.cut(series)
* pd.qcut(series)

In [57]:
transactions.head(2)

   CNIC  TransactionID Transaction Date Description  Amount
0    14              1       1990-01-31       TopUP  707642
1     6              1       1990-02-28          FT  693605

In [59]:
slabs = [1,10000,50000,100000,500000,99000000]
pd.cut(transactions.Amount,slabs).value_counts()

(500000, 99000000]    11
(100000, 500000]       7
(10000, 50000]         1
(1, 10000]             1
(50000, 100000]        0
Name: Amount, dtype: int64

In [62]:
slabs = [0, 0.6, 0.8, .95, 1]
pd.qcut(transactions.Amount,slabs).value_counts()

(1565.999, 589278.8]     12
(589278.8, 711432.2]      4
(711432.2, 859905.45]     3
(859905.45, 989589.0]     1
Name: Amount, dtype: int64

# Group by

In [65]:
#dataframeName.groupby("Col").agg([count])             optional(min,max,avg,sum, std)(int,float)
#dataframeName.groupby(by="Col")[["colname"]].agg([count]) 
#dataframeName.groupby(by=[col1,col2,..]).agg([count])

In [64]:
transactions = pd.DataFrame({"CNIC": np.random.choice([14,6,19,21], size=(20)),
                   "TransactionID":np.random.randint(1,2, size=(20)),
                  "Transaction Date":pd.date_range('1990-01-01', periods=20, freq="M"),
                   "Description":np.random.choice(["TopUP","IBFT","FT"], size=(20)),
                            "Amount":np.random.randint(1,1000000, size=(20)),
                            "City":np.random.choice(["Karachi","Islamabad","Lahore"], size=(20))})



transactions

    CNIC  TransactionID Transaction Date Description  Amount       City
0      6              1       1990-01-31        IBFT  890207    Karachi
1     14              1       1990-02-28        IBFT  243072     Lahore
2     14              1       1990-03-31       TopUP    3863  Islamabad
3     14              1       1990-04-30          FT  321676     Lahore
4     14              1       1990-05-31          FT  728420    Karachi
5     21              1       1990-06-30          FT  641338     Lahore
6     14              1       1990-07-31        IBFT  354929  Islamabad
7     19              1       1990-08-31          FT  768527    Karachi
8     19              1       1990-09-30       TopUP  496530  Islamabad
9      6              1       1990-10-31        IBFT  818496    Karachi
10     6              1       1990-11-30        IBFT  350302    Karachi
11    19              1       1990-12-31          FT  290423    Karachi
12    14              1       1991-01-31          FT  922524     Lahore
13    14              1       1991-02-28          FT  525820     Lahore
14     6              1       1991-03-31          FT   34734  Islamabad
15    14              1       1991-04-30       TopUP  122936  Islamabad
16     6              1       1991-05-31        IBFT  648747    Karachi
17    19              1       1991-06-30       TopUP  300083    Karachi
18     6              1       1991-07-31          FT  583275    Karachi
19    14              1       1991-08-31       TopUP  599240     Lahore

In [66]:
a = transactions.groupby("City").agg(['count'])
a

           CNIC TransactionID Transaction Date Description Amount
          count         count            count       count  count
City
Islamabad     5             5                5           5      5
Karachi       9             9                9           9      9
Lahore        6             6                6           6      6

In [67]:
a = transactions.groupby("City")[["CNIC"]].agg(['count'])
a

           CNIC
          count
City
Islamabad     5
Karachi       9
Lahore        6

In [68]:
a = transactions.groupby("City")[["City"]].agg(['count'])
a

           City
          count
City
Islamabad     5
Karachi       9
Lahore        6

In [74]:
a = transactions.groupby(["City","Description"]).Amount.agg(['count',min,max, np.mean, np.std])
a

                       count     min     max           mean            std
City      Description
Islamabad FT               1   34734   34734   34734.000000            NaN
          IBFT             1  354929  354929  354929.000000            NaN
          TopUP            3    3863  496530  207776.333333  257057.590517
Karachi   FT               4  290423  768527  592661.250000  216637.378797
          IBFT             4  350302  890207  676938.000000  240144.500043
          TopUP            1  300083  300083  300083.000000            NaN
Lahore    FT               4  321676  922524  602839.500000  250775.617605
          IBFT             1  243072  243072  243072.000000            NaN
          TopUP            1  599240  599240  599240.000000            NaN

Categorical data/nominal data
'orange','mango'


ordinal data
1,3,2,4 (discreate/countinues)
A,B,C
a,b,c
i,ii,iii

In [76]:
a = input("Enter no")
a.split("")

Enter no3 3 32 2 3 423

['3', '3', '32', '2', '3', '423']

In [77]:
list(str(232))

['2', '3', '2']

In [83]:
transactions.groupby([transactions['Transaction Date'].dt.year, "City","CNIC"]).agg(['count'])

                                TransactionID Transaction Date Description  \
                                        count            count       count
Transaction Date City      CNIC
1990             Islamabad 14               2                2           2
                           19               1                1           1
                 Karachi   6                3                3           3
                           14               1                1           1
                           19               2                2           2
                 Lahore    14               2                2           2
                           21               1                1           1
1991             Islamabad 6                1                1           1
                           14               1                1           1
                 Karachi   6                2                2           2
                           19               1                1           1
                 Lahore    14               3                3           3

                                Amount
                                 count
Transaction Date City      CNIC
1990             Islamabad 14        2
                           19        1
                 Karachi   6         3
                           14        1
                           19        2
                 Lahore    14        2
                           21        1
1991             Islamabad 6         1
                           14        1
                 Karachi   6         2
                           19        1
                 Lahore    14        3